Revit 2027 API
FilteredWorksetCollector.GetWorksetIdIterator Method
 Returns a FilteredWorksetIdIterator to the worksets passing the current filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredWorksetIdIterator GetWorksetIdIterator()
Public Function GetWorksetIdIterator As FilteredWorksetIdIterator
public:
FilteredWorksetIdIterator^ GetWorksetIdIterator()
member GetWorksetIdIterator : unit -> FilteredWorksetIdIterator
Return Value
FilteredWorksetIdIterator
Remarks
 Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace